"""
[제목]
- 곱하기 혹은 더하기

[내용]
- 각 자리가 숫자(0~9)로 이루어진 문자열 S가 주어졌을 때, 왼쪽부터 오른쪽으로 하나씩 모든 숫자를 확인하며
- 숫자 사이에 * 혹은 + 연산자를 넣어 결과적으로 만들어질 수 있는 가장 큰 수를 구하는 프로그램을 작성하라
- 단 + 보다 * 를 먼저 계산하는 일반적인 방식과는 달리, 모든 연산은 왼쪽부터 순서대로 이루어진다고 가정한다.

[입력 조건]
- 첫째 줄에 여러 개의 숫자로 구성된 하나의 문자열 S가 주어진다.

[출력 조건]
- 첫째 줄에 만들어질 수 있는 가장 큰 수를 출력한다.
"""

# %%
S = [int(X) for X in list(str(input()))]

result = S[0]
for i in range(1, len(S)):
    if S[i] + result >= S[i] * result:
        result += S[i]
    else:
        result *= S[i]

print(result)
